Revit 2024 API
FabricationConfiguration.SetConfiguration Method (FabricationConfigurationInfo)
 Set the fabrication configuration with global profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetConfiguration(
	FabricationConfigurationInfo fabricationConfigurationInfo
)
Visual Basic
Public Sub SetConfiguration ( _
	fabricationConfigurationInfo As FabricationConfigurationInfo _
)
Visual C++
public:
void SetConfiguration(
	FabricationConfigurationInfo^ fabricationConfigurationInfo
)
Parameters
fabricationConfigurationInfo
Type: Autodesk.Revit.DB.FabricationConfigurationInfo
 The desired fabrication configuration.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document. -or- Cannot set the configuration.
See Also
FabricationConfiguration Class
SetConfiguration Overload
Autodesk.Revit.DB Namespace